Revit 2026 API

# DisplacementPathStyle Enumeration

---

Used to control the graphical representation of a DisplacementPath element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DisplacementPathStyle
```
```vb
Public Enumeration DisplacementPathStyle
```
```cpp
public enum class DisplacementPathStyle
```
```fsharp
type DisplacementPathStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Jogged | 1 | A jogged path consisting of three straight lines is used to represent each stage of the displacement. |
| Straight | 0 | A single straight line is used to represent each stage of the displacement. |

#### Reference

Autodesk.Revit.DB Namespace